#include <iostream>
#include <string>

using namespace std;

int main() {
    string hello = "Hello, friend!"s;
    cout << hello << endl;
    return 0;
}




/*
Создайте строковую переменную с содержимым "Hello, friend!" и выведите её на экран.
*/