#include <iostream>

using namespace std;

int main() {
    int x;
    int y;
    cin >> x >> y;

    int z = 1;
    cout << "Your answer: ";
    cout << x + y + z;
    return 0;
}




/*
Написать программу, которая должна считывать два целых числа — x и y — и выводить в одну строку "Your answer: " и сумму чисел x + y + z, где z = 1
*/