#include <iostream>
using namespace std;

int main() {
int N;
    cin >> N;
    cout << (N + 1) % 2 + N + 1;
  return 0;
}






/*
Следующее четное

На вход дается натуральное число N. Выведите следующее за ним четное число

Формат входных данных:
На вход дается целое положительное число N, не превышающее 10000.

Формат выходных данных:
Выведите одно целое число - ответ на задачу.
*/