#include <iostream>
using namespace std;

int main() {
int a, b;
    cin >> a >> b;
    if (a>b)
    {
        cout << a;
    }
    else if (a==b)
    {
        cout << b;
    }
    else
    {
        cout << b;
    }

    // var. 2

    //int a, b;
    //cin >> a >> b;
    //cout << (a > b ? a : b);

  return 0;
}






/*
Даны два целых числа. Выведите значение наибольшего из них. Если числа равны, выведите любое из них.
Формат входных данных:
Вводятся два числа.
Формат выходных данных:
Выведите ответ на задачу.
*/