#include <iostream>
using namespace std;

int main() {
    int width, height;
    cout << "Enter rectangle width and height"s << endl;
    cin >> width >> height;
    cout << "Rectangle area is "s << width * height << endl;
    return 0;
}




/*
Написать программу, которая просит ввести два целых числа: ширину и высоту прямоугольника, а потом выводит его площадь.
*/