#include <iostream>

using namespace std;

int main() {
    double a, b;
    cin >> a >> b;
    cout << (int)(a+b);
return 0;
}




/*
Напишите программу, которая считывает два double-числа и выводит целую часть их суммы.
*/