#include <iostream>

using namespace std;

int main() {
    double x, y;
    cin >> x >> y;
    cout << x + y << endl;
    return 0;
}




/*
Написать программу, которая должна считывать 2 числа типа double и выводить их сумму.
*/