#include <iostream>
using namespace std;

int main() {
    double n, x;
    cin >> n;
    x = n;
    cout << x - (int) n;
  return 0;
}




/*
Дано положительное действительное число X. Выведите его дробную часть.

Формат входных данных:
Вводятся положительное действительное число.

Формат выходных данных:
Выведите ответ на задачу.
*/