#include <iostream>

using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    cout << a / b;
    return 0;
}




/*
Напишите программу, которая считывает два целых числа и выводит их частное.
*/